heatFlow_simulation/BenardCells/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       1700;
    }
    ceiling
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       1790;
    }
    sideWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       1880;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1800;
        startFace       1900;
    }
)

// ************************************************************************* //
